{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"batch_input_shape": [null, 1, 128, 128], "dtype": "float32", "data_format": "channels_first", "padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_1", "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_2", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_3", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_4", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "filters": 64, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_5", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_6", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_6", "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "trainable": true, "name": "zero_padding2d_7", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "name": "conv2d_7", "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 256, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 256, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 3, "activity_regularizer": null, "bias_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}